[
  {
    "title": "Data Analyst",
    "company": "Northern Bank",
    "location": "Woburn, MA",
    "link": "https://www.linkedin.com/jobs/view/data-analyst-at-northern-bank-4289707725?position=1&pageNum=0&refId=OG12c9A%2B9fwB02i6YEaDAQ%3D%3D&trackingId=w8bxiP6TPTSu9Jhm%2FcuwGQ%3D%3D",
    "postedDate": "1 month ago",
    "salary": "$3",
    "description": "The Enterprise Data Management team is a nimble, cross-functional group that thrives on solving complex data challenges. We manage enterprise data assets, engineer scalable reporting solutions, and deliver actionable insights that inform strategic decisions across the bank.\n\nWe’re seeking a Data Analyst with a strong analytical mindset and a passion for coding—someone who can bridge the gap between raw data and business intelligence. This role offers the opportunity to work with modern data stacks and contribute to the evolution of our data infrastructure.\n\nKEY RESPONSIBILITIES:\n\nData Analysis & Insights Generation (30%)\n\n\nPerform exploratory data analysis (EDA) and statistical profiling using Python (leveraging libraries such as Pandas, NumPy, and SciPy) and Java for backend data processing tasks\nDevelop reusable scripts and modular code for data wrangling, anomaly detection, and KPI tracking\nApply object-oriented programming principles to build scalable data pipelines and analytical utilities\n\n\nData Visualization & Reporting (40%)\n\n\nDesign and implement interactive dashboards using Tableau, Power BI, or custom-built web interfaces\nUtilize DAX, Power Query, and Salesforce APIs to integrate disparate data sources into unified reporting layers\nTranslate complex datasets into intuitive visual narratives that support executive decision-making\n\n\nData Extraction & Preparation (40%)\n\n\nBuild and maintain ETL workflows using Python, Java, and SQL-based tools to extract data from PostgreSQL, MSSQL, and cloud-based data lakes\nAutomate data cleansing and transformation routines using Apache POI (for Excel automation in Java), VBA, and Power Query\nEnsure data integrity through rigorous validation, schema enforcement, and exception handling\n\n\nQUALIFICATIONS:\n\n\n2+ years of experience in data analysis, software development, or business intelligence, preferably in financial services or a regulated industry\nProficiency in Python and Java, with experience in data manipulation, automation, and backend integration\nStrong SQL skills and familiarity with relational databases (PostgreSQL, MSSQL)\nExperience with data visualization tools (Power BI, Tableau) and dashboard development\nFamiliarity with ETL processes, data modeling, and version control systems (e.g., Git)\nExcellent communication and stakeholder management skills\nBachelor’s degree in Computer Science, Data Science, Information Systems, or a related field\nHigh proficiency in technical writing and documentation\n\n\nNICE TO HAVES (Or Things You'll Get To Learn):\n\n\nExperience with DuckDB, Polars, or other high-performance analytical engines\nExposure to cloud data platforms like AWS Redshift, Azure Synapse, or Google BigQuery\nFamiliarity with Git for version control and collaborative development\nInterest in machine learning, predictive modeling, or statistical inference\n\n\nAbout Northern Bank & Trust Company\n\nNorthern Bank is a full-service bank dedicated to providing practical, common sense financial solutions to help our customers live their lives and grow their businesses. From deposit products to loans to payment and collections services, we work hands-on with our entrepreneurial customers, both locally and across the country, to provide the financial support they need to realize their personal and business goals. Founded in 1960, Northern Bank has assets of over $3 billion with 12 locations serving communities throughout Middlesex County. Northern Bank is a Member of the FDIC, and an Equal Housing Lender. For more information on online banking services, please visit www.NBTC.com or follow Northern Bank on Facebook (/NorthernBankM A/), Twitter (@northernbankma), Instagram (@northernbankma) and LinkedIn (company/northern-bank-ma/).\n\nPowered by JazzHR\n\nnljh9cgjoS\nShow more"
  },
  {
    "title": "Data Analyst II",
    "company": "Criteo",
    "location": "New York, United States",
    "link": "https://www.linkedin.com/jobs/view/data-analyst-ii-at-criteo-4268189447?position=2&pageNum=0&refId=OG12c9A%2B9fwB02i6YEaDAQ%3D%3D&trackingId=qt2evLD7dVQY9GXzExTTXA%3D%3D",
    "postedDate": "6 days ago",
    "salary": "Pay found in job post\n\nRetrieved from the description.\n\nBase pay range\n$79,700.00/yr - $98,000.00/yr",
    "description": "What You'll Do:\n\n\nPartner with commercial stakeholders to deliver Client Business Reviews, including advanced analyses, optimization recommendations, and forecasting strategies to drive incremental revenue\nDesign, manage, analyze, and communicate results of controlled A/B tests\nCreate and share market trends and benchmarks to support strategic planning\nCollaborate with Product Analytics to execute on performance-improving initiatives\nInfluence the Product Roadmap by synthesizing client needs into clear, data-backed recommendations for product and R&D teams\nLeverage the partnership with our Global Client Operations Center to identify ways to improve efficiency in executing tasks through automation or delegation\nDevelop subject matter expertise in multiple growth areas, serving as a go-to resource for the team and building high-impact, client-facing collateral\nTroubleshoot and resolve campaign delivery and performance issues in time-sensitive, high-impact scenarios\nStay informed of industry advancements in AdTech, analytics, forecasting, and attribution\nEffectively communicate project timelines, risks, and results to stakeholders\n\n\n\nWho You Are:\n\n\nMinimum 3+ years of full-time, analytics-relevant experience\nBachelor’s degree in a quantitative field or equivalent practical experience; advanced degree a plus\nNative-level English fluency\n\n\n\nProven ability to independently structure analyses and provide stratgic recommendations that influence business outcomes\n\n\nStrong analytical and problem-solving skills with the ability to manipulate complex data sets, identify patterns, and develop actionable insights at scale\nSkilled in data storytelling and crafting impactful presentations for both technical and non-technical audiences\nConceptual and practical understanding of statistics, A/B testing, and experimental design\nProficiency in SQL, Python, and Tableau for automating analyses and creating compelling visualizations\nDemonstrated ability to manage multiple stakeholders, set expectations, and drive alignment across cross-functional teams\nComfortable with ambiguity; able to evaluate trade-offs across multiple analytics approaches and recommend the most impactful path\nA proactive, collaborative teammate who can also lead projects and knowledge-sharing initiatives within the team\n\n\n\nWe acknowledge that many candidates may not meet every single role requirement listed above. If your experience looks a little different from our requirements but you believe that you can still bring value to the role, we’d love to see your application!\n\nWho We Are:\n\nCriteo is a leader in commerce media, helping brands, agencies, and publishers create meaningful consumer connections through AI-powered advertising solutions. We’re shaping a more open and sustainable digital future for advertising.\n\nAt Criteo, our culture is as unique as it is diverse. From our offices across the globe or from the comfort of home, our 3,600 Criteos collaborate together to build an open, impactful, and forward-thinking environment.\n\nWhat We Offer:\n\n🏢 Ways of working – Our hybrid model blends home with in-office experiences, making space for both.\n\n📈 Grow with us – Learning, mentorship & career development programs.\n\n💪 Your wellbeing matters – Health benefits, wellness perks & mental health support.\n\n🤝 A team that cares – Diverse, inclusive, and globally connected.\n\n💸 Fair pay & perks – Attractive salary, with performance-based rewards and family-friendly policies, plus the potential for equity depending on role and level.\n\nAdditional benefits may vary depending on the country where you work and the nature of your employment with Criteo.\n\nFor employees based in the US, certain roles at Criteo are eligible for additional rewards, including quarterly or annual bonus and restricted stock units. US-based employees receive access to healthcare, dental, and vision insurance, a 401(k) plan with company match, short-term and long-term disability coverage, life insurance, family forming and wellness benefits, Flexible Work financial support, learning opportunities, and a robust annual leave plan including volunteer time off and summer vacation days.\n\nThe US base salary pay range for this position per year is:\n\n$79,700 - $98,000\nShow more"
  },
  {
    "title": "Join LinkedIn",
    "company": "",
    "location": "",
    "link": "https://www.linkedin.com/jobs/view/data-analyst-at-digital-prospectors-4305590510?position=3&pageNum=0&refId=OG12c9A%2B9fwB02i6YEaDAQ%3D%3D&trackingId=qOyIyh6J7bsnCNKxA%2BvkVg%3D%3D",
    "postedDate": "",
    "salary": "",
    "description": "Join LinkedIn\nEmail\nPassword (6+ characters)\n\nBy clicking Agree & Join, you agree to the LinkedIn User Agreement, Privacy Policy, and Cookie Policy.\n\nAgree & Join\n\nAlready on Linkedin? Sign in"
  },
  {
    "title": "Join LinkedIn",
    "company": "",
    "location": "",
    "link": "https://www.linkedin.com/jobs/view/data-analyst-internship-at-connectprep-4302836554?position=4&pageNum=0&refId=OG12c9A%2B9fwB02i6YEaDAQ%3D%3D&trackingId=0de4qm0VXhz2Y1NsXRW83w%3D%3D",
    "postedDate": "",
    "salary": "",
    "description": "Join LinkedIn\nEmail\nPassword (6+ characters)\n\nBy clicking Agree & Join, you agree to the LinkedIn User Agreement, Privacy Policy, and Cookie Policy.\n\nAgree & Join\n\nAlready on Linkedin? Sign in"
  },
  {
    "title": "Join LinkedIn",
    "company": "",
    "location": "",
    "link": "https://www.linkedin.com/jobs/view/business-intelligence-analyst-at-mbta-4302554296?position=5&pageNum=0&refId=OG12c9A%2B9fwB02i6YEaDAQ%3D%3D&trackingId=qAo%2BS0GbUF6%2B5nIqwsOZmw%3D%3D",
    "postedDate": "",
    "salary": "",
    "description": "Join LinkedIn\nEmail\nPassword (6+ characters)\n\nBy clicking Agree & Join, you agree to the LinkedIn User Agreement, Privacy Policy, and Cookie Policy.\n\nAgree & Join\n\nAlready on Linkedin? Sign in"
  }
]
